app/controllers/gists_controller.rb

SELECT "gists".* FROM "gists" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "gists"
---
  def index
    @gists = Gist.paginate(page: params[:page], per_page: 5).order('created_at DESC')

SELECT "gists".* FROM "gists" WHERE (lang LIKE '%java%')
---
   def search
    @gists = Gist.search(params[:lang])

INSERT INTO "gists" ("created_at", "date", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 15 Mar 2014 15:29:09 UTC +00:00], ["date", Sat, 15 Mar 2014], ["description", ""], ["lang", "c"], ["snippet", "asd"], ["updated_at", Sat, 15 Mar 2014 15:29:09 UTC +00:00]]
---
  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save

UPDATE "gists" SET "description" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["description", "asdasdasd"], ["updated_at", Sat, 15 Mar 2014 16:02:01 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @gist.update(gist_params)